information-technology/programming/programming-languages/latex/latex-reference.org
In Latex, all the commands start with \
* Greek Letters
| Command | Symbol     | Command    | Symbol        | Command  | Symbol      |
|---------+------------+------------+---------------+----------+-------------|
| beta    | $\beta$    | gamma      | $\gamma$      | delta    | $\delta$    |
| epsilon | $\epsilon$ | varepsilon | $\varepsilon$ | zeta     | $\zeta$     |
| eta     | $\eta$     | theta      | $\theta$      | vartheta | $\vartheta$ |
| iota    | $\iota$    | kappa      | $\kappa$      | lambda   | $\lambda$   |
| mu      | $\mu$      | nu         | $\nu$         | xi       | $\xi$       |
| pi      | $\pi$      | varpi      | $\varpi$      | rho      | $\rho$      |
| varrho  | $\varrho$  | sigma      | $\sigma$      | varsigma | $\varsigma$ |
| tau     | $\tau$     | upsilon    | $\upsilon$    | phi      | $\phi$      |
| varphi  | $\varphi$  | chi        | $\chi$        | psi      | $\psi$      |
| omega   | $\omega$   | lambda     | $\lambda$     | alpha    | $\alpha$    |

| Command | Symbol    | Command | Symbol     | Command | Symbol    |
|---------+-----------+---------+------------+---------+-----------+
| Gamma   | $\Gamma$  | Delta   | $\Delta$   | Theta   | $\Theta$  |
| Lambda  | $\Lambda$ | Xi      | $\Xi$      | Pi      | $\Pi$     |
| Sigma   | $\Sigma$  | Upsilon | $\Upsilon$ | Phi     | $\Phi$    |
| Psi     | $\Psi$    | Omega   | $\Omega$   | Lambda  | $\Lambda$ |

* Relationship
| Command  | Symbol      | Command  | Symbol      | Command  | Symbol      |
|----------+-------------+----------+-------------+----------+-------------|
| le       | $\le$       | ge       | $\ge$       | equiv    | $\equiv$    |
| ll       | $\ll$       | gg       | $\gg$       | sim      | $\sim$      |
| simeq    | $\simeq$    | subset   | $\subset$   | supset   | $\supset$   |
| approx   | $\approx$   | subseteq | $\subseteq$ | supseteq | $\supseteq$ |
| in       | $\in$       | ni       | $\ni$       | propto   | $\propto$   |
| parallel | $\parallel$ | perp     | $\perp$     | notin    | $\notin$    |
| ne       | $\ne$       |          |             |          |             |
* Operator
| Command | Symbol   | Command | Symbol    | Command  | Symbol      |
|---------+----------+---------+-----------+----------+-------------|
| pm      | $\pm$    | mp      | $\mp$     | div      | $\div$      |
| times   | $\times$ | star    | $\star$   | setminus | $\setminus$ |
| cup     | $\cup$   | cap     | $\cap$    | ast      | $\ast$      |
| cdot    | $\cdot$  | circ    | $\circ$   | bullet   | $\bullet$   |
| oplus   | $\oplus$ | ominus  | $\ominus$ | diamond  | $\diamond$  |
| odot    | $\odot$  | otimes  | $\otimes$ |          |             |
* Acculation
| Command | Symbol  | Command | Symbol  | Command | Symbol |
|---------+---------+---------+---------+---------+--------|
| sum     | $\sum$  | prod    | $\prod$ | int     | $\int$ |
| oint    | $\oint$ |         |         |         |        |
* Dot
| Command | Symbol   | Command | Symbol   | Command | Symbol  |
|---------+----------+---------+----------+---------+---------|
| cdot    | $\cdot$  | cdots   | $\cdots$ | dots    | $\dots$ |
| vdots   | $\vdots$ | ddots   | $\ddots$ |         |         |
