information-technology/programming/programming-languages/latex/latex-reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-28 Tue 14:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Chyson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd852b22">1. Greek Letters</a></li>
<li><a href="#org922ec5d">2. Relationship</a></li>
<li><a href="#org78402d1">3. Operator</a></li>
<li><a href="#orgc25b94c">4. Acculation</a></li>
<li><a href="#orgf141cd6">5. Dot</a></li>
<li><a href="#org8423bd7">6. Arrow</a></li>
<li><a href="#orgbfd092f">7. Matrix</a></li>
<li><a href="#orge2201be">8. Case</a></li>
<li><a href="#orgf52e708">9. Special Sign</a></li>
<li><a href="#orga7ffe38">10. MAth Speical Typeface</a></li>
<li><a href="#orgbccfdcf">11. Vector</a></li>
<li><a href="#org7162089">12. Decorator</a></li>
<li><a href="#org798f466">13. Equation Label and Ref</a></li>
<li><a href="#org8768a15">14. Argmin argmax</a></li>
<li><a href="#org90c59ad">15. Underset and overset</a></li>
<li><a href="#org4f9677d">16. Underbrace and overbrace</a></li>
<li><a href="#orga17fde6">17. Miscellaneous</a></li>
<li><a href="#org08bc6c0">18. choose</a></li>
</ul>
</div>
</div>
<p>
In Latex, all the commands start with \<br />
</p>
