information-technology/programming/programming-languages/latex/latex-reference.org
* Matrix
#+BEGIN_SRC latex
\begin{equation}
\begin{matrix}
a & b & c \\
d & e & f \\
g & h & k
\end{matrix}
\end{equation}
#+END_SRC

\begin{equation}
\begin{matrix}
a & b & c \\
d & e & f \\
g & h & k
\end{matrix}
\end{equation}



#+BEGIN_SRC latex
bmatrix: bracket matrix
\begin{equation}
\begin{bmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{bmatrix}
\end{equation}
#+END_SRC

\begin{equation}
\begin{bmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{bmatrix}
\end{equation}

#+BEGIN_SRC latex
vmatrix: vertical matrix
\begin{equation}
\begin{vmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{vmatrix}
\end{equation}
#+END_SRC

\begin{equation}
\begin{vmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{vmatrix}
\end{equation}

#+BEGIN_SRC latex
pmatrix: parentheses matrix
\begin{equation}
\begin{pmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{pmatrix}
\end{equation}
#+END_SRC

\begin{equation}
\begin{pmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{pmatrix}
\end{equation}



* Case
#+BEGIN_SRC latex
\begin{equation}
\begin{cases}
1 & x > 0 \\
0 & x \le 0
\end{cases}
\end{equation}
#+END_SRC
\begin{equation}
\begin{cases}
1 & x > 0 \\
0 & x \le 0
\end{cases}
\end{equation}

* Special Sign

| Command  | Symbol      | Command    | Symbol               | Command | Symbol     |
|----------+-------------+------------+----------------------+---------+------------|
| infty    | $\infty$    | forall     | $\forall$            | exists  | $\exists$  |
| triangle | $\triangle$ | nabla      | $\nabla$             | partial | $\partial$ |
| top      | $\top$      | bot        | $\bot$               | angle   | $\angle$   |
| neg      | $\neg$      | lfloor     | $\lfloor$            | rfloor  | $\rfloor$  |
| prime    | $\prime$    | lceil      | $\lceil$             | rceil   | $\rceil$   |
| emptyset | $\emptyset$ | varnothing | \usepackage{amssymb} |         |            |

* MAth Speical Typeface
| Command  | Symbol                                                                      |
|----------+-----------------------------------------------------------------------------|
| mathbb   | $\mathbb{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathrm   | $\mathrm{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathsf   | $\mathsf{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathcal  | $\mathcal{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$  |
| mathbf   | $\mathbf{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathtt   | $\mathtt{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathit   | $\mathit{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$   |
| mathscr  | $\mathscr{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$  |
| mathfrak | $\mathfrak{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}$ |
| top      | $\top$                                                                      |

* Vector
#+BEGIN_SRC latex
\begin{equation}
\vec{A} 
\end{equation}

#+END_SRC
\begin{equation}
\vec{A} 
\end{equation}

* Decorator
| COMMAND | SYMBOL      | COMMAND   | SYMBOL          |
| hat     | $\hat{p}$   | widehat   | $\widehat{p}$   |
| dot     | $\dot{p}$   | ddot      | $\ddot{p}$      |
| acute   | $\acute{p}$ | grave     | $\grave{p}$     |
| breve   | $\breve{p}$ | check     | $\check{p}$     |
| tilde   | $\tilde{p}$ | widetilde | $\widetilde{p}$ |
| bar     | $\bar{p}$   | vec       | $\vec{a}$       |

