information-technology/programming/programming-languages/latex/latex-reference.html
<div id="outline-container-orgbfd092f" class="outline-2">
<h2 id="orgbfd092f"><span class="section-number-2">7</span> Matrix</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #68228b;">\begin</span>{<span style="color: #0000cd;">equation</span>}
<span style="color: #68228b;">\begin</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">matrix</span><span style="color: #8b4513;">}</span>
<span style="color: #8b4513;">a </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> b </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> c </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">d </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> e </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> f </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">g </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> h </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> k</span>
<span style="color: #68228b;">\end</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">matrix</span><span style="color: #8b4513;">}</span>
<span style="color: #68228b;">\end</span>{<span style="color: #0000cd;">equation</span>}
</pre>
</div>

\begin{equation}
\begin{matrix}
a & b & c \\
d & e & f \\
g & h & k
\end{matrix}
\end{equation}



<div class="org-src-container">
<pre class="src src-latex">bmatrix: bracket matrix
<span style="color: #68228b;">\begin</span>{<span style="color: #0000cd;">equation</span>}
<span style="color: #68228b;">\begin</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">bmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #8b4513;">a </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> b </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> c </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">d </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> e </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> f </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">g </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> h </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> k</span>
<span style="color: #68228b;">\end</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">bmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #68228b;">\end</span>{<span style="color: #0000cd;">equation</span>}
</pre>
</div>

\begin{equation}
\begin{bmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{bmatrix}
\end{equation}

<div class="org-src-container">
<pre class="src src-latex">vmatrix: vertical matrix
<span style="color: #68228b;">\begin</span>{<span style="color: #0000cd;">equation</span>}
<span style="color: #68228b;">\begin</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">vmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #8b4513;">a </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> b </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> c </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">d </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> e </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> f </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">g </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> h </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> k</span>
<span style="color: #68228b;">\end</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">vmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #68228b;">\end</span>{<span style="color: #0000cd;">equation</span>}
</pre>
</div>

\begin{equation}
\begin{vmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{vmatrix}
\end{equation}

<div class="org-src-container">
<pre class="src src-latex">pmatrix: parentheses matrix
<span style="color: #68228b;">\begin</span>{<span style="color: #0000cd;">equation</span>}
<span style="color: #68228b;">\begin</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">pmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #8b4513;">a </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> b </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> c </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">d </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> e </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> f </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">g </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> h </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> k</span>
<span style="color: #68228b;">\end</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">pmatrix</span><span style="color: #8b4513;">}</span>
<span style="color: #68228b;">\end</span>{<span style="color: #0000cd;">equation</span>}
</pre>
</div>

\begin{equation}
\begin{pmatrix}
a & b & c \\
d & e & f \\
g & h & k
\end{pmatrix}
\end{equation}
</div>
</div>



<div id="outline-container-orge2201be" class="outline-2">
<h2 id="orge2201be"><span class="section-number-2">8</span> Case</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-latex"><span style="color: #68228b;">\begin</span>{<span style="color: #0000cd;">equation</span>}
<span style="color: #68228b;">\begin</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">cases</span><span style="color: #8b4513;">}</span>
<span style="color: #8b4513;">1 </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> x &gt; 0 </span><span style="color: #ff0000; font-weight: bold;">\\</span>
<span style="color: #8b4513;">0 </span><span style="color: #ff0000; font-weight: bold;">&amp;</span><span style="color: #8b4513;"> x </span><span style="color: #8b4513;">\le</span><span style="color: #8b4513;"> 0</span>
<span style="color: #68228b;">\end</span><span style="color: #8b4513;">{</span><span style="color: #0000cd;">cases</span><span style="color: #8b4513;">}</span>
<span style="color: #68228b;">\end</span>{<span style="color: #0000cd;">equation</span>}
</pre>
</div>
\begin{equation}
\begin{cases}
1 & x > 0 \\
0 & x \le 0
\end{cases}
\end{equation}
</div>
</div>

<div id="outline-container-orgf52e708" class="outline-2">
<h2 id="orgf52e708"><span class="section-number-2">9</span> Special Sign</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Symbol</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Symbol</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Symbol</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">infty</td>
<td class="org-left">\(\infty\)</td>
<td class="org-left">forall</td>
<td class="org-left">\(\forall\)</td>
<td class="org-left">exists</td>
<td class="org-left">\(\exists\)</td>
</tr>

<tr>
<td class="org-left">triangle</td>
<td class="org-left">\(\triangle\)</td>
<td class="org-left">nabla</td>
<td class="org-left">\(\nabla\)</td>
<td class="org-left">partial</td>
<td class="org-left">\(\partial\)</td>
</tr>

<tr>
<td class="org-left">top</td>
<td class="org-left">\(\top\)</td>
<td class="org-left">bot</td>
<td class="org-left">\(\bot\)</td>
<td class="org-left">angle</td>
<td class="org-left">\(\angle\)</td>
</tr>

<tr>
<td class="org-left">neg</td>
<td class="org-left">\(\neg\)</td>
<td class="org-left">lfloor</td>
<td class="org-left">\(\lfloor\)</td>
<td class="org-left">rfloor</td>
<td class="org-left">\(\rfloor\)</td>
</tr>

<tr>
<td class="org-left">prime</td>
<td class="org-left">\(\prime\)</td>
<td class="org-left">lceil</td>
<td class="org-left">\(\lceil\)</td>
<td class="org-left">rceil</td>
<td class="org-left">\(\rceil\)</td>
</tr>

<tr>
<td class="org-left">emptyset</td>
<td class="org-left">\(\emptyset\)</td>
<td class="org-left">varnothing</td>
<td class="org-left">\usepackage{amssymb}</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga7ffe38" class="outline-2">
<h2 id="orga7ffe38"><span class="section-number-2">10</span> MAth Speical Typeface</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Symbol</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">mathbb</td>
<td class="org-left">\(\mathbb{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathrm</td>
<td class="org-left">\(\mathrm{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathsf</td>
<td class="org-left">\(\mathsf{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathcal</td>
<td class="org-left">\(\mathcal{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathbf</td>
<td class="org-left">\(\mathbf{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathtt</td>
<td class="org-left">\(\mathtt{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathit</td>
<td class="org-left">\(\mathit{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathscr</td>
<td class="org-left">\(\mathscr{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">mathfrak</td>
<td class="org-left">\(\mathfrak{abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789}\)</td>
</tr>

<tr>
<td class="org-left">top</td>
<td class="org-left">\(\top\)</td>
</tr>
</tbody>
</table>
</div>
</div>
